# cch's YOLO 基于YOLOv8
# 自定义YOLOv8模型，集成D-FPN和DAL，用于密集目标检测。

# 参数设置
nc: 80 # 类别数量
# 基于YOLOv8 带有 D-FPN 和 DAL 的骨干网络（backbone）
backbone:
  # [来自层编号, 重复次数, 模块类型, 参数]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, DFPN, [256, 128]] # 添加D-FPN模块
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, DAL, [512]] # 添加DAL模块，聚焦密集特征
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8 带有 D-FPN 和 DAL 的头部网络（head）
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 拼接骨干网络的P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 拼接骨干网络的P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-小目标)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # 拼接头部网络的P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-中等目标)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # 拼接头部网络的P5
  - [-1, 1, DAL, [1536]] # DAL 的输入通道数为拼接后通道数（动态调整）
  - [-1, 3, C2f, [1024]] # 21 (P5/32-大目标)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)